Autodesk.Revit.DB.CategoryNameMap
A map that contains a mapping of category name to its category object.

Autodesk.Revit.DB.CategoryNameMap.Insert(System.String,Autodesk.Revit.DB.Category)
System.Int32
Insert the specified category with the specified name into the map.
key: The name to be used for inserting the category into the map.
item: The category to be inserted into the map.
Returns: Returns whether the category was inserted into the map.

Autodesk.Revit.DB.CategoryNameMap.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the map.
Returns: Returns a forward moving iterator to the map.

Autodesk.Revit.DB.CategoryNameMap.ReverseIterator
Autodesk.Revit.DB.CategoryNameMapIterator
Retrieve a backward moving iterator to the map.
Returns: Returns a backward moving iterator to the map.

Autodesk.Revit.DB.CategoryNameMap.ForwardIterator
Autodesk.Revit.DB.CategoryNameMapIterator
Retrieve a forward moving iterator to the map.
Returns: Returns a forward moving iterator to the map.

Autodesk.Revit.DB.CategoryNameMap.Erase(System.String)
System.Int32
Removes a category with the specified name from the map.
key: The name of the category to be erased.
Returns: The number of categories that were erased from the map.

Autodesk.Revit.DB.CategoryNameMap.Contains(System.String)
System.Boolean
Tests for the existence of a category with that name within the map.
key: The category name to be searched for.
Returns: The Contains method returns True if the name is within the map, otherwise False.

Autodesk.Revit.DB.CategoryNameMap.Clear
void
Removes every category from the map, rendering it empty.

Autodesk.Revit.DB.CategoryNameMap.Size
System.Int32
get
Returns the number of categories that are in the map.

Autodesk.Revit.DB.CategoryNameMap.Item(System.String)
Autodesk.Revit.DB.Category
Gets or sets a category at a specified name within the map.
key: The name of the category to be set or retrieved.
Returns: Returns the category at the specified name.

Autodesk.Revit.DB.CategoryNameMap.IsEmpty
System.Boolean
get
Test to see if the map is empty.
Remarks: If the map is empty then True will be returned, otherwise False.